<a 
 href="https://colab.research.google.com/github/LearnPythonWithRune/LearnPython/blob/main/colab/final/15 - Lesson - Pandas.ipynb"
 target="_parent">
<img 
 src="https://colab.research.google.com/assets/colab-badge.svg"
alt="Open In Colab"/>
</a>

# Pandas
### Goal
- Learn basics of Pandas
- Read CSV files with Pandas
- Explore the DataFrame
- Learn about GroupBy
- Datetime and GroupBy
- How to export to Excel
- Create a chart: [Example](https://xlsxwriter.readthedocs.io/example_chart_column.html)

In [1]:
import pandas as pd

In [2]:
d = {'Cars': ['Porsche', 'Porsche', 'Ferrari', 'Ferrari'], 'Speed': [200, 215, 305, 195]}

In [3]:
d

{'Cars': ['Porsche', 'Porsche', 'Ferrari', 'Ferrari'],
 'Speed': [200, 215, 305, 195]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

      Cars  Speed
0  Porsche    200
1  Porsche    215
2  Ferrari    305
3  Ferrari    195

In [6]:
df.mean()

/tmp/ipykernel_21258/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Speed    228.75
dtype: float64

In [7]:
df[df['Cars'] == 'Porsche']

      Cars  Speed
0  Porsche    200
1  Porsche    215

In [8]:
df.groupby('Cars').sum()

         Speed
Cars
Ferrari    500
Porsche    415

In [9]:
speed_check = pd.read_csv("https://raw.githubusercontent.com/LearnPythonWithRune/LearnPython/main/colab/files/speed_check.csv", delimiter=';', parse_dates=True, index_col="Date")

In [10]:
speed_check

                Car  Speed
Date
2021-03-15  Porsche    315
2021-03-30      BMW    250
2021-04-02  Ferrari    295
2021-04-10      BMW    180
2021-04-15  Porsche    210
2021-04-20  Ferrari    230
2021-04-23      BMW    175
2021-04-30      BMW    205

In [11]:
speed_check.index

DatetimeIndex(['2021-03-15', '2021-03-30', '2021-04-02', '2021-04-10',
               '2021-04-15', '2021-04-20', '2021-04-23', '2021-04-30'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [12]:
speed_check.dtypes

Car      object
Speed     int64
dtype: object

In [13]:
speed_check.groupby("Car").mean()

         Speed
Car
BMW      202.5
Ferrari  262.5
Porsche  262.5

In [14]:
monthly = speed_check.groupby(pd.Grouper(freq='M')).mean()

In [15]:
monthly.index = monthly.index.month_name()

In [16]:
monthly

            Speed
Date
March  282.500000
April  215.833333

In [17]:
speed_check.to_excel("SpeedCheck.xlsx")

In [18]:
workbook = pd.ExcelWriter("SpeedCheck.xlsx")
speed_check.groupby("Car").mean().to_excel(workbook, sheet_name="Cars")
monthly.to_excel(workbook, sheet_name='Monthly')
workbook.close()

In [19]:
workbook = pd.ExcelWriter("SpeedCheck.xlsx")
speed_check.groupby("Car").mean().to_excel(workbook, sheet_name="Cars")
monthly.to_excel(workbook, sheet_name='Monthly')

chart1 = workbook.book.add_chart({'type': 'column'})

# Configure the first series.
chart1.add_series({
    'name':       'Cars',
    'categories': '=Cars!$A$2:$A$4',
    'values':     '=Cars!$B$2:$B$4',
})

workbook.sheets['Cars'].insert_chart('D2', chart1)

workbook.close()